app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-09 03:53:41.225060"], ["topic_id", 3], ["updated_at", "2014-05-09 03:53:41.225060"]]

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-09 03:17:55.714271"], ["description", "lewklfmlkw"], ["title", "rojgorw"], ["updated_at", "2014-05-09 03:17:55.714271"]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]